---
kind: property
id: P:Autodesk.Revit.DB.XYZ.BasisY
zh: 点
source: html/3ace8772-001c-443d-ab7d-46ada4dba628.htm
---
# Autodesk.Revit.DB.XYZ.BasisY Property

**中文**: 点

The basis of the Y axis.

## Syntax (C#)
```csharp
public static XYZ BasisY { get; }
```

## Remarks
The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.